Repository: KhalilHen/portofolio_
Catalog: lib/l10n/arb/app_*.arb
Languages: nl

# startText
source: Hi i am Khalil
nl: Hoi ik ben Khalil

# startSubtitle
source: A Software Developer student at ROC-Nijmegen. Currently in my 3rd year of my 4-year study.
nl: Een software Developer student van ROC-Nijmegen momenteel zit ik in mijn 3de jaar van mijn 4 jaar opleiding

source: About me
nl: Over mij

# aboutMeDescription
source: Hi, my name is Khalil, and I’m an 18-year-old passionate developer with a keen interest in game development and app development. Currently, I’m expanding my expertise by learning Three.js and Godot 4, aiming to deepen my skills in creating interactive and immersive gaming experiences I’m constantly exploring new technologies to enhance my knowledge and bring innovative ideas to life.
nl: Hallo, mijn naam is Khalil, en ik ben een 18-jarige gepassioneerde ontwikkelaar met een sterke interesse in game- en app-ontwikkeling. Momenteel breid ik mijn expertise uit door Three.js en Godot 4 te leren, met als doel mijn vaardigheden in het creëren van interactieve en meeslepende game-ervaringen te verdiepen. Ik ben constant op zoek naar nieuwe technologieën om mijn kennis te vergroten en innovatieve ideeën tot leven te brengen

source: Experience
nl: Ervaring

# experienceDescription
source: Below, I've listed the various languages, frameworks, and tools I've worked with. To get a clearer picture of my skills, check out my projects and GitHub page by
nl: Hieronder heb ik de verschillende talen, frameworks, en tools opgesomd waarmee ik heb gewerkt. Om een beter beeld te krijgen van mijn vaardigheden check de projecten hier onder uit, en mijn Github pagina.

# experienceDescriptionHyperLink
source: Click here!
nl: Klik hier!

# project
source: Projects
nl: Projecten

# projectTitle0
source: Platformer Learning Project
nl: Platformer oefen project

# projectDescription0
source: Platformer Learning Project is a project that I created to learn more about game development, and a introduction to unity. The project is a simple platformer game where the player can move left and right, jump, and collect powerups. The project isn’t perfect but it was great for learning the basics of game development and Unity.
nl: Platformer oefen project is een project dat ik heb gemaakt, om meer te weten te komen over game development. En een introductie voor mij tot Unity. De project is vrij simpel je hebt een player die kan zich voortbewegen van links naar rechts, springen, en verschillende powerups oppakken. De project is niet optimaal, maar het was een goede oefening om de basis te leren van Unity, en game development.

# projectTitle1
source: Dinner app (not finished)
nl: maaltijden app (not finished)

# projectDescription1
source: Dinner App is a project designed to inspire users with meal ideas for today or help them create their own weekly meal planner by building personalized lists
nl: maaltijden app is een project ontworpen om de gebruiker inspiratie te geven. Voor hun avond eten doordmiddel van suggesties van verschillende gerechten, en de mogelijkheid om een eigen lijst te creëren

# projectDescription2
source: Geoprofs is a leave system for a fictiv geodesy bureau company that use currently excel for there leave system Were we have to create a application, that fills his needs. The application is made with React and Laravel. The application is still in development
nl: Geoprofs is een verlofsysteem voor een fictief landmeetkundige bureau bedrijf dat momenteel excel gebruik voor hun verlofsysteem. Waarbij wij dus een applicatie moeten maken ter vervanging van hun excel systeem. De project word gemaakt in React als front-end, en Laravel als back-end
